
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура ТипОрганизацииПриИзменении(Элемент)
	УстановитьВидимость();
КонецПроцедуры



&НаСервере
Процедура УстановитьВидимость()
	Если Объект.ТипОрганизации = ПредопределенноеЗначение("Перечисление.ТипыОрганизаций.ЮридическоеЛицо") Тогда
		Элементы.ГлавныйБухгалтер.Видимость = Истина;
	Иначе
		Элементы.ГлавныйБухгалтер.Видимость = Ложь;
		КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если Объект.ТипОрганизации = ПредопределенноеЗначение("Перечисление.ТипыОрганизаций.ЮридическоеЛицо") И СтрДлина(Объект.ИНН)<>10 Тогда
		Сообщить("У юридического лица длина ИНН должна быть 10 симфолов ");
		Отказ=Истина;
	ИначеЕсли Объект.ТипОрганизации = ПредопределенноеЗначение("Перечисление.ТипыОрганизаций.ИндивидуальныйПредприниматель") И СтрДлина(Объект.ИНН)<>12 Тогда
		Сообщить("У индивидуального предпринимателя длина ИНН должна быть 12 симфолов ");
		Отказ=Истина;
	КонецЕсли;
КонецПроцедуры
        

&НаКлиенте
Процедура РуководительПриИзменении(Элемент)
	Объект.ДолжностьРуководителя = ОбщиеФункции.ПолучитьДолжностьСотрудника(Объект.Руководитель);
	
КонецПроцедуры
