Процедура СформироватьНаименование()
	Объект.Наименование = СтрШаблон("%1 (%2)",Объект.Владелец, Объект.Номенклатура);	
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураПриИзменении(Элемент)
	СформироватьНаименование();
	Объект.СрокДействия = ОбщиеФункции.ПолучитьСрокДействияАбонемента(Объект.Номенклатура);
	Объект.ДнейЗаморозки = ОбщиеФункции.ПолучитьДнейЗаморозки(Объект.Номенклатура);
	ПересчитатьДатуОкончанияАбонемента();
	ПересчитатьОстатокДнейЗаморозки();

КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьДатуОкончанияАбонемента() 
	НоваяДатаОкончанияАбонемента=0;
	НоваяДатаОкончанияАбонемента = ДобавитьМесяц(Объект.ДатаАктивации,Объект.СрокДействия)+Объект.Заморозки.Итог("ДнейЗаморозки")*86400;
	Объект.ДатаОкончания = НоваяДатаОкончанияАбонемента;
КонецПроцедуры




&НаКлиенте
Процедура ПересчитатьОстатокДнейЗаморозки() 
	Объект.ОстатокДнейЗаморозки = Объект.ДнейЗаморозки - Объект.Заморозки.Итог("ДнейЗаморозки");
КонецПроцедуры

&НаКлиенте
Процедура ДатаАктивацииПриИзменении(Элемент)
	ПересчитатьДатуОкончанияАбонемента();
КонецПроцедуры


&НаКлиенте
Процедура СрокДействияПриИзменении(Элемент)
	ПересчитатьДатуОкончанияАбонемента();
КонецПроцедуры


&НаКлиенте
Процедура ЗаморозкиДатаНачалаПриИзменении(Элемент)
	СтрокаТЧ = Элементы.Заморозки.ТекущиеДанные;
	РаботаСТабличнымиЧастями.ПересчитатьДниЗаморозки(СтрокаТЧ,Объект.ОстатокДнейЗаморозки);
	ПересчитатьДатуОкончанияАбонемента();
	ПересчитатьОстатокДнейЗаморозки();
КонецПроцедуры


&НаКлиенте
Процедура ЗаморозкиДатаОкончанияПриИзменении(Элемент)
	СтрокаТЧ = Элементы.Заморозки.ТекущиеДанные;
	РаботаСТабличнымиЧастями.ПересчитатьДниЗаморозки(СтрокаТЧ,Объект.ОстатокДнейЗаморозки);
	ПересчитатьДатуОкончанияАбонемента();
	ПересчитатьОстатокДнейЗаморозки();
КонецПроцедуры

                  
&НаКлиенте
Процедура ЗаморозкиДнейЗаморозкиПриИзменении(Элемент)
	ПересчитатьДатуОкончанияАбонемента();
	ПересчитатьОстатокДнейЗаморозки();
КонецПроцедуры


&НаКлиенте
Процедура ДнейЗаморозкиПриИзменении(Элемент)
	ПересчитатьОстатокДнейЗаморозки();
КонецПроцедуры


&НаКлиенте
Процедура ЗаморозкиПослеУдаления(Элемент)
	ПересчитатьДатуОкончанияАбонемента();
	ПересчитатьОстатокДнейЗаморозки();
КонецПроцедуры


&НаКлиенте
Процедура ВладелецПриИзменении(Элемент)
	СформироватьНаименование();
КонецПроцедуры

