Функция ПолучитьЦенуПродажиНаДату (Номенклатура, ВидЦены) Экспорт
	
	Если ВидЦены = ПредопределенноеЗначение("Перечисление.ВидыЦенПродаж.ПустаяСсылка") Тогда
		ВидЦены = Перечисления.ВидыЦенПродаж.Розничная;
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
	               |	ЦеныНоменклатурыСрезПоследних.ВидЦены КАК ВидЦены,
	               |	ЦеныНоменклатурыСрезПоследних.Цена КАК Цена
	               |ИЗ
	               |	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	               |			,
	               |			Номенклатура = &Номенклатура
	               |				И ВидЦены = &ВидЦены) КАК ЦеныНоменклатурыСрезПоследних";
	
	Запрос.УстановитьПараметр("Номенклатура",Номенклатура);
	Запрос.УстановитьПараметр("ВидЦены",ВидЦены);
    РезультатЗапроса = Запрос.Выполнить();	
	Если РезультатЗапроса.Пустой() Тогда
		Сообщить("В базе данных не найдены цены для данной номенклатуры!");
		возврат 0;
	КонецЕсли;	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
    Возврат Выборка.Цена;

КонецФункции                              


Функция ПолучитьЦенуПокупкиНаДату (Номенклатура, Поставщик) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЦеныНоменклатурыПоставщиковСрезПоследних.Номенклатура КАК Номенклатура,
	               |	ЦеныНоменклатурыПоставщиковСрезПоследних.Цена КАК Цена,
	               |	ЦеныНоменклатурыПоставщиковСрезПоследних.Поставщик КАК Поставщик
	               |ИЗ
	               |	РегистрСведений.ЦеныНоменклатурыПоставщиков.СрезПоследних(
	               |			,
	               |			Номенклатура = &Номенклатура
//	               |				И Период = &Период
	               |				И Поставщик = &Поставщик) КАК ЦеныНоменклатурыПоставщиковСрезПоследних";
	
	Запрос.УстановитьПараметр("Номенклатура",Номенклатура);
//	Запрос.УстановитьПараметр("Период",Период); 
	Запрос.УстановитьПараметр("Поставщик",Поставщик);
    РезультатЗапроса = Запрос.Выполнить();	
	Если РезультатЗапроса.Пустой() Тогда
		Сообщить("В базе данных не найдены цены для данной номенклатуры!");
		возврат 0;
	КонецЕсли;	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
    Возврат Выборка.Цена;

КонецФункции 


//Функция ПолучитьМассивЦен1 (Период, Поставщик, МассивНоменклатур) Экспорт
//	
//	МассивЦен = Новый Массив;
//	Запрос = Новый Запрос;
//	Запрос.Текст = "ВЫБРАТЬ
//	               |	ЦеныНоменклатурыПоставщиковСрезПоследних.Номенклатура КАК Номенклатура,
//	               |	ЦеныНоменклатурыПоставщиковСрезПоследних.Цена КАК Цена,
//	               |	ЦеныНоменклатурыПоставщиковСрезПоследних.Поставщик КАК Поставщик
//	               |ИЗ
//	               |	РегистрСведений.ЦеныНоменклатурыПоставщиков.СрезПоследних(
//	               |			&Период,
//	               |			Поставщик = &Поставщик
//	               |				И Цена В (&МассивНоменклатур)) КАК ЦеныНоменклатурыПоставщиковСрезПоследних";
//	
//	Запрос.УстановитьПараметр("Период",Период); 
//	Запрос.УстановитьПараметр("Поставщик",Поставщик);
//	Запрос.УстановитьПараметр("МассивНоменклатур",МассивНоменклатур);

//    ЦеныНоменклатуры  = Запрос.Выполнить().Выгрузить();
//	
//    Возврат ЦеныНоменклатуры;

//КонецФункции 


//   