
Процедура ПересчитатьСуммуДокумента()
   	Объект.СуммаДокумента = Объект.Товары.Итог("Сумма")+ Объект.Услуги.Итог("Сумма");
 КонецПроцедуры

 &НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	СтрокаТЧ = Элементы.Товары.ТекущиеДанные;
	Если ЗначениеЗаполнено(СтрокаТЧ.Номенклатура) Тогда
		СтрокаТЧ.Цена = РаботаСЦенами.ПолучитьЦенуПокупкиНаДату(СтрокаТЧ.Номенклатура, Объект.Контрагент);
	Иначе
		СтрокаТЧ.Цена = 0;		
	КонецЕсли;
	РаботаСТабличнымиЧастями.ПересчитатьСуммуВСтрокеТабличнойЧасти(СтрокаТЧ);
    ПересчитатьСуммуДокумента();

КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	СтрокаТЧ = Элементы.Товары.ТекущиеДанные;  
	РаботаСТабличнымиЧастями.ПересчитатьСуммуВСтрокеТабличнойЧасти(СтрокаТЧ);
	ПересчитатьСуммуДокумента();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	СтрокаТЧ = Элементы.Товары.ТекущиеДанные;  
	РаботаСТабличнымиЧастями.ПересчитатьСуммуВСтрокеТабличнойЧасти(СтрокаТЧ);
	ПересчитатьСуммуДокумента();
КонецПроцедуры

&НаКлиенте
Процедура УслугиНоменклатураПриИзменении(Элемент)
	СтрокаТЧ = Элементы.Услуги.ТекущиеДанные;
	Если ЗначениеЗаполнено(СтрокаТЧ.Номенклатура) Тогда
		СтрокаТЧ.Цена = РаботаСЦенами.ПолучитьЦенуПокупкиНаДату(СтрокаТЧ.Номенклатура, Объект.Контрагент);
		СтрокаТЧ.СтатьяЗатрат = ОбщиеФункции.ПолучитьСтатьюЗатратПоНоменклатуре(СтрокаТЧ.Номенклатура);
	Иначе
		СтрокаТЧ.Цена = 0;		
	КонецЕсли;
	РаботаСТабличнымиЧастями.ПересчитатьСуммуВСтрокеТабличнойЧасти(СтрокаТЧ);
    ПересчитатьСуммуДокумента();

КонецПроцедуры

&НаКлиенте
Процедура УслугиКоличествоПриИзменении(Элемент)
	СтрокаТЧ = Элементы.Услуги.ТекущиеДанные;  
	РаботаСТабличнымиЧастями.ПересчитатьСуммуВСтрокеТабличнойЧасти(СтрокаТЧ);  
    ПересчитатьСуммуДокумента();

КонецПроцедуры

&НаКлиенте
Процедура УслугиЦенаПриИзменении(Элемент)
	СтрокаТЧ = Элементы.Услуги.ТекущиеДанные;  
	РаботаСТабличнымиЧастями.ПересчитатьСуммуВСтрокеТабличнойЧасти(СтрокаТЧ);  
    ПересчитатьСуммуДокумента();


КонецПроцедуры

&НаКлиенте
Процедура ТоварыПослеУдаления(Элемент)
    ПересчитатьСуммуДокумента();
КонецПроцедуры

&НаКлиенте
Процедура УслугиПослеУдаления(Элемент)
	    ПересчитатьСуммуДокумента();

КонецПроцедуры

//&НаСервереБезКонтекста
//Функция ПолучитьСтатьюЗатратПоНоменклатуре(Номенклатура)
//	Запрос = Новый Запрос;
//	Запрос.Текст = "ВЫБРАТЬ
//	               |	Номенклатура.СтатьяЗатрат КАК СтатьяЗатрат
//	               |ИЗ
//	               |	Справочник.Номенклатура КАК Номенклатура
//	               |ГДЕ
//	               |	Номенклатура.Ссылка = &Ссылка";
//	Запрос.УстановитьПараметр("Ссылка",Номенклатура);
//	Выборка = Запрос.Выполнить().Выбрать();
//	Выборка.Следующий();
//	Возврат Выборка.СтатьяЗатрат;

//КонецФункции



//&НаСервере
//Процедура ОбновлениеЦенВТабличнойЧасти()
//	МассивНоменклатур = Новый Массив;
//	Для Каждого ТекСтрока Из Объект.Товары Цикл
//	    МассивНоменклатур.Добавить(ТекСтрока.Номенклатура);
//	КонецЦикла;	
//	ЦеныНоменклатуры = РаботаСЦенами.ПолучитьМассивЦен1(Объект.Дата, Объект.Контрагент, МассивНоменклатур);
//	Для Каждого ТекСтрока Из Объект.Товары Цикл
//	    НайденнаяЦена = ЦеныНоменклатуры.Найти(ТекСтрока.Номенклатура, "Номенклатура");
//	    Если НайденнаяЦена = Неопределено Тогда
//	        ТекСтрока.Цена = 0;
//	    Иначе
//	        ТекСтрока.Цена = НайденнаяЦена.Цена;
//	    КонецЕсли;
//	ТекСтрока.Сумма=ТекСтрока.Цена*ТекСтрока.Количество;
//	КонецЦикла;
//	
//	
//КонецПроцедуры



//&НаКлиенте
//Процедура ОбновитьЦены(Команда)
//	ОбновлениеЦенВТабличнойЧасти();
//	 
//КонецПроцедуры




//&НаСервере
//Процедура ОбновлениеЦенВТабличнойЧасти()
//	МассивНоменклатур = Новый Массив;
//	Для Каждого ТекСтрока Из Объект.Услуги Цикл
//	    МассивНоменклатур.Добавить(ТекСтрока.Номенклатура);
//	КонецЦикла;	
//	ЦеныНоменклатуры = РаботаСЦенами.ПолучитьМассивЦен1(Объект.Дата, Объект.Поставщик, МассивНоменклатур);
//	Для Каждого ТекСтрока Из Объект.Услуги Цикл
//	    НайденнаяЦена = ЦеныНоменклатуры.Найти(ТекСтрока.Номенклатура, "Номенклатура");
//	    Если НайденнаяЦена = Неопределено Тогда
//	        ТекСтрока.Цена = 0;
//	    Иначе
//	        ТекСтрока.Цена = НайденнаяЦена.Цена;
//	    КонецЕсли;
//	ТекСтрока.Сумма=ТекСтрока.Цена*ТекСтрока.Количество;
//	КонецЦикла;
//	
//	
//КонецПроцедуры



//&НаКлиенте
//Процедура ОбновитьЦены(Команда)
//	ОбновлениеЦенВТабличнойЧасти();
//КонецПроцедуры
