Функция JSONВОбъект(СтрокаЧтения) Экспорт
    ЧтениеДанных = Новый ЧтениеJSON;
    ЧтениеДанных.УстановитьСтроку(СтрокаЧтения);            
    Объект = ПрочитатьJSON(ЧтениеДанных);    
    Возврат Объект;
КонецФункции

Функция ПолучитьТекстJSON(ДанныеJSON) Экспорт    
    ЗаписьJSON = Новый ЗаписьJSON;
    ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON(, Символы.Таб);
    ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписиJSON);
    ЗаписатьJSON(ЗаписьJSON, ДанныеJSON);    
    Возврат ЗаписьJSON.Закрыть();
КонецФункции

  

Функция ОтправитьЗаписьВЦентральнуюБазу(СтруктураРеквизитовДокументаJSON) Экспорт    
    Соединение    = Новый HTTPСоединение(Константы.ЛокальныйIP.Получить(),,Константы.ПользовательВОсновнойБазе.Получить());//(1)
    HTTPЗапросЗапрос     = Новый HTTPЗапрос("Fitnes/hs/CustomerOrders/createOrder");
    HTTPЗапросЗапрос.УстановитьТелоИзСтроки(СтруктураРеквизитовДокументаJSON);
    Ответ = Соединение.ОтправитьДляОбработки(HTTPЗапросЗапрос);
    
    Если Ответ.КодСостояния = 200 Тогда        
        УспешноОтправлен = Истина;
    Иначе
        УспешноОтправлен = Ложь;
    КонецЕсли;
    
    Возврат УспешноОтправлен;    
КонецФункции



Функция ОтправитьДанныеДляРегистрацииВЦентральнуюБазу(СтруктураРеквизитовДокументаJSON) Экспорт    
    Соединение    = Новый HTTPСоединение(Константы.ЛокальныйIP.Получить(),,Константы.ПользовательВОсновнойБазе.Получить());//(1)
    HTTPЗапросЗапрос     = Новый HTTPЗапрос("Fitnes/hs/users/regUser");
    HTTPЗапросЗапрос.УстановитьТелоИзСтроки(СтруктураРеквизитовДокументаJSON);
    Ответ = Соединение.ОтправитьДляОбработки(HTTPЗапросЗапрос);
    
    Если Ответ.КодСостояния = 200 Тогда        
        УспешноОтправлен = Истина;
    Иначе
        УспешноОтправлен = Ложь;
    КонецЕсли;
    
    Возврат УспешноОтправлен;    
КонецФункции