&НаКлиенте
Процедура УстановитьВидимость()
	Если Объект.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Абонемент") Тогда
		Элементы.СрокДействияАбонемента.Видимость = Истина;
		Элементы.ДнейЗаморозки.Видимость = Истина;
		Элементы.ДлительностьУслуги.Видимость = Ложь;
	ИначеЕсли Объект.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Товар") Тогда
		Элементы.СрокДействияАбонемента.Видимость = Ложь; 
		Элементы.ДнейЗаморозки.Видимость = Ложь;
		Элементы.ДлительностьУслуги.Видимость = Ложь;
	ИначеЕсли Объект.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Услуга") Тогда
		Элементы.ДлительностьУслуги.Видимость = Истина;
		Элементы.СрокДействияАбонемента.Видимость = Ложь;
		Элементы.ДнейЗаморозки.Видимость = Ложь;
	КонецЕсли;
	
		
	
КонецПроцедуры

&НаКлиенте
Процедура ТипНоменклатурыПриИзменении(Элемент)
	МассивОчищаемыхРеквизитов = Новый Массив;
	Если ЗначениеЗаполнено(Объект.ДнейЗаморозки) Тогда
		Если Объект.ТипНоменклатуры <> ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Абонемент") Тогда
		    МассивОчищаемыхРеквизитов.Добавить("СрокДействияАбонемента");
		    МассивОчищаемыхРеквизитов.Добавить("ДнейЗаморозки");
		    ТекстВопроса = "При изменении реквизита ""ТипНоменклатуры"" будут очищены следующие данные:
		    | Срок действия абонемента
			| Дней заморозки
		    | Продолжить?";
		КонецЕсли;
		
		Если ЗначениеЗаполнено(МассивОчищаемыхРеквизитов) Тогда 
		    Оповещение = Новый ОписаниеОповещения("ПослеОтветаНаВопросОбИзмененииТипаНоменклатуры", ЭтаФорма, МассивОчищаемыхРеквизитов); 
		    ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет,,,"Внимание!");
		Иначе
		    ТипНоменклатуры =  Объект.ТипНоменклатуры;
		    УстановитьВидимость(); 
		КонецЕсли;
	Иначе
		УстановитьВидимость();
	КонецЕсли;
	
	Объект.СчетБухгалтерскогоУчета = Неопределено;
КонецПроцедуры

&НаКлиенте
Процедура ПослеОтветаНаВопросОбИзмененииТипаНоменклатуры(Результат,	ДополнительныеПараметры) Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда
	    Для Каждого Реквизит Из ДополнительныеПараметры Цикл
	        Объект[Реквизит] = Неопределено;
	    КонецЦикла;
	    УстановитьВидимость();
	    ТипНоменклатуры =  Объект.ТипНоменклатуры;
	Иначе
	    Объект.ТипНоменклатуры = ТипНоменклатуры;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура СчетБухгалтерскогоУчетаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	СписокДоступныхЗначений = Новый СписокЗначений;
	Если Объект.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Товар") Тогда
		СписокДоступныхЗначений.Добавить(ПредопределенноеЗначение("ПланСчетов.Хозрасчетный.Товары"));
	ИначеЕсли Объект.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Материал") Тогда
		СписокДоступныхЗначений.Добавить(ПредопределенноеЗначение("ПланСчетов.Хозрасчетный.Материалы"));
	ИначеЕсли Объект.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Услуга") Тогда
		СписокДоступныхЗначений.Добавить(ПредопределенноеЗначение("ПланСчетов.Хозрасчетный.РасходыНаПродажу"));
	ИначеЕсли объект.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Абонемент") Тогда
		СписокДоступныхЗначений.Добавить(ПредопределенноеЗначение("ПланСчетов.Хозрасчетный.ПрочиеДоходыИРасходы"));
	КонецЕсли;
	
	ДанныеВыбора = СписокДоступныхЗначений;
		
	
	
КонецПроцедуры

