Процедура ПересчитатьДниЗаморозки(СтрокаТЧ,ОстатокДнейЗаморозки) Экспорт
	Если ЗначениеЗаполнено(СтрокаТЧ.ДатаНачала) И ЗначениеЗаполнено(СтрокаТЧ.ДатаОкончания) Тогда
		Если ((СтрокаТЧ.ДатаОкончания - СтрокаТЧ.ДатаНачала)/86400)>ОстатокДнейЗаморозки Тогда
			СтрокаТЧ.ДатаОкончания = СтрокаТЧ.ДатаНачала+ОстатокДнейЗаморозки*86400;
			СтрокаТЧ.ДнейЗаморозки = (СтрокаТЧ.ДатаОкончания - СтрокаТЧ.ДатаНачала)/86400;	
		Иначе
			СтрокаТЧ.ДнейЗаморозки = (СтрокаТЧ.ДатаОкончания - СтрокаТЧ.ДатаНачала)/86400;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры


Процедура ПересчитатьСуммуВСтрокеТабличнойЧасти(СтрокаТабличнойЧасти) Экспорт
	СтрокаТабличнойЧасти.Сумма = СтрокаТабличнойЧасти.Цена*СтрокаТабличнойЧасти.Количество;    
КонецПроцедуры



