
&НаКлиенте
Процедура ТипКонтрагентаПриИзменении(Элемент)
	УстановитьВидимость()
КонецПроцедуры



&НаКлиенте
Процедура УстановитьВидимость()
	Если Объект.ТипКонтрагента = ПредопределенноеЗначение("Перечисление.ТипыКонтрагентов.Клиент") Тогда
		Элементы.Наименование.Заголовок = "Ф.И.О. Клиента";
        Элементы.ДатаРожденияКлиента.Видимость = Истина;
		Элементы.ПолКлиента.Видимость=Истина;
		Элементы.РекламныйИсточник.Видимость=Истина;
		Элементы.Абонемент.Видимость = Истина;
		Элементы.Договор.Видимость=Ложь;
				
	Иначе
		Элементы.Наименование.Заголовок = "Наименование";
        Элементы.ДатаРожденияКлиента.Видимость = Ложь;
		Элементы.ПолКлиента.Видимость=Ложь;
		Элементы.РекламныйИсточник.Видимость=Ложь;
		Элементы.Договор.Видимость=Истина;	
		Элементы.Абонемент.Видимость = Ложь;
		
	КонецЕсли;

    

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимость()
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если Объект.ТипКонтрагента = ПредопределенноеЗначение("Перечисление.ТипыКонтрагентов.Клиент") Тогда
		 Объект.Договор = Неопределено;
	Иначе
		Объект.ДатаРожденияКлиента = Неопределено;
		Объект.ПолКлиента = Неопределено;
		Объект.РекламныйИсточник = Неопределено;	
		 
    КонецЕсли;
КонецПроцедуры


