
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Документы.РеализацияТоваровИУслуг.ПолучитьМакет("Печать1");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РеализацияТоваровИУслуг.Договор КАК Договор,
	|	РеализацияТоваровИУслуг.ДокументОснование КАК ДокументОснование,
	|	РеализацияТоваровИУслуг.Контрагент КАК Контрагент,
	|	РеализацияТоваровИУслуг.Ответственный КАК Ответственный,
	|	РеализацияТоваровИУслуг.Склад КАК Склад,
	|	РеализацияТоваровИУслуг.Сотрудник КАК Сотрудник,
	|	РеализацияТоваровИУслуг.СуммаДокумента КАК СуммаДокумента,
	|	РеализацияТоваровИУслуг.Товары.(
	|		НомерСтроки КАК НомерСтроки,
	|		Номенклатура КАК Номенклатура,
	|		Количество КАК Количество,
	|		Цена КАК Цена,
	|		Сумма КАК Сумма
	|	) КАК Товары,
	|	РеализацияТоваровИУслуг.Услуги.(
	|		НомерСтроки КАК НомерСтроки,
	|		Услуга КАК Услуга,
	|		Количество КАК Количество,
	|		Цена КАК Цена,
	|		Сумма КАК Сумма
	|	) КАК Услуги,
	|	РеализацияТоваровИУслуг.Абонементы.(
	|		НомерСтроки КАК НомерСтроки,
	|		Абонемент КАК Абонемент,
	|		Количество КАК Количество,
	|		Активировать КАК Активировать,
	|		Сумма КАК Сумма
	|	) КАК Абонементы,
	|	РеализацияТоваровИУслуг.Дата КАК Дата,
	|	РеализацияТоваровИУслуг.Номер КАК Номер
	|ИЗ
	|	Документ.РеализацияТоваровИУслуг КАК РеализацияТоваровИУслуг
	|ГДЕ
	|	РеализацияТоваровИУслуг.Ссылка В(&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьТоварыШапка = Макет.ПолучитьОбласть("ТоварыШапка");
	ОбластьТовары = Макет.ПолучитьОбласть("Товары");
	ОбластьУслугиШапка = Макет.ПолучитьОбласть("УслугиШапка");
	ОбластьУслуги = Макет.ПолучитьОбласть("Услуги");
	ОбластьАбонементыШапка = Макет.ПолучитьОбласть("АбонементыШапка");
	ОбластьАбонементы = Макет.ПолучитьОбласть("Абонементы");
	Подвал = Макет.ПолучитьОбласть("Подвал");

	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;  
		
  		ОбластьЗаголовок.Параметры.Заполнить(Выборка);
       	ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьТоварыШапка);
		ВыборкаТовары = Выборка.Товары.Выбрать();
		Пока ВыборкаТовары.Следующий() Цикл
			ОбластьТовары.Параметры.Заполнить(ВыборкаТовары);
			ТабДок.Вывести(ОбластьТовары, ВыборкаТовары.Уровень());
		КонецЦикла;

		ТабДок.Вывести(ОбластьУслугиШапка);
		ВыборкаУслуги = Выборка.Услуги.Выбрать();
		Пока ВыборкаУслуги.Следующий() Цикл
			ОбластьУслуги.Параметры.Заполнить(ВыборкаУслуги);
			ТабДок.Вывести(ОбластьУслуги, ВыборкаУслуги.Уровень());
		КонецЦикла;

		ТабДок.Вывести(ОбластьАбонементыШапка);
		ВыборкаАбонементы = Выборка.Абонементы.Выбрать();
		Пока ВыборкаАбонементы.Следующий() Цикл
			ОбластьАбонементы.Параметры.Заполнить(ВыборкаАбонементы);
			ТабДок.Вывести(ОбластьАбонементы, ВыборкаАбонементы.Уровень());
		КонецЦикла;

		Подвал.Параметры.Заполнить(Выборка);
		Подвал.Параметры.СуммаДокумента = СтрШаблон("%1 (%2)", Выборка.СуммаДокумента, ЧислоПрописью(Выборка.СуммаДокумента, 
		,"рубль, рубля, рублей, м, копейка, копейки, копеек, ж"));
		ТабДок.Вывести(Подвал);

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры


Функция ПроверитьОплатуДокумента (ДокументРТУ) Экспорт
	Запрос = Новый Запрос;         
	Запрос.УстановитьПараметр("Ссылка",ДокументРТУ);
	Запрос.Текст = "ВЫБРАТЬ
	               |	СУММА(ПриходныйКассовыйОрдер.СуммаДокумента) КАК СуммаДокумента,
	               |	ПриходныйКассовыйОрдер.ДокументОснование КАК ДокументОснование
	               |ПОМЕСТИТЬ ВТ_Поступления
	               |ИЗ
	               |	Документ.ПриходныйКассовыйОрдер КАК ПриходныйКассовыйОрдер
	               |ГДЕ
	               |	ПриходныйКассовыйОрдер.ДокументОснование = &Ссылка
	               |	И ПриходныйКассовыйОрдер.Проведен
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПриходныйКассовыйОрдер.ДокументОснование
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	РеализацияТоваровИУслуг.СуммаДокумента - ЕСТЬNULL(ВТ_Поступления.СуммаДокумента, 0) КАК ОсталосьОплатить,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(ВТ_Поступления.СуммаДокумента, 0) > 0
	               |				И РеализацияТоваровИУслуг.СуммаДокумента - ЕСТЬNULL(ВТ_Поступления.СуммаДокумента, 0) > 0
	               |			ТОГДА ЗНАЧЕНИЕ(Перечисление.ОплатаДокумента.ЧастичноОплачен)
	               |		КОГДА ЕСТЬNULL(ВТ_Поступления.СуммаДокумента, 0) = 0
	               |			ТОГДА ЗНАЧЕНИЕ(Перечисление.ОплатаДокумента.НеОплачен)
	               |		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ОплатаДокумента.ПолностьюОплачен)
	               |	КОНЕЦ КАК ПризнакОплаты
	               |ИЗ
	               |	Документ.РеализацияТоваровИУслуг КАК РеализацияТоваровИУслуг
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Поступления КАК ВТ_Поступления
	               |		ПО РеализацияТоваровИУслуг.Ссылка = ВТ_Поступления.ДокументОснование
	               |ГДЕ
	               |	РеализацияТоваровИУслуг.Ссылка = &Ссылка";
	СтруктураОтвета = Новый Структура("ПризнакОплаты, ОсталосьОплатить",Перечисления.ОплатаДокумента.НеОплачен,0);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	ЗаполнитьЗначенияСвойств(СтруктураОтвета, Выборка);
	возврат СтруктураОтвета;


	
	
	
	
КонецФункции                                                                                                 
