
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ВыборкаИзРезультатаЗапроса") Тогда
 		Владелец = ДанныеЗаполнения.Контрагент;
		Менеджер = ДанныеЗаполнения.Сотрудник; 
		ДокументПродажи = ДанныеЗаполнения.Ссылка;

		ДатаПродажи = ДанныеЗаполнения.Дата;
		Наименование = СтрШаблон("%1 (%2)",ДанныеЗаполнения.Контрагент, ДанныеЗаполнения.Номенклатура);
		Номенклатура = ДанныеЗаполнения.Номенклатура;
		СрокДействия = ОбщиеФункции.ПолучитьСрокДействияАбонемента(Номенклатура);
		ДнейЗаморозки = ОбщиеФункции.ПолучитьДнейЗаморозки(Номенклатура);
		Если ДанныеЗаполнения.Активировать Тогда
			ДатаАктивации = ДанныеЗаполнения.Дата;
			ДатаОкончания = ДобавитьМесяц(ДатаАктивации,СрокДействия);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры




